#import <Foundation/Foundation.h>
#import <UIKit/UIKit.h>
#import <substrate.h>
#import <UIKit/UIControl.h>
#import <spawn.h>
//--------------------------------------------------------------------------------------------------
//🄸🄵  🅄 🄽🄴🄴🄳 🄷🄴🄻🄿  🅆🄸🅃🄷 🅃🄷🄴 🄲🄾🄳🄴🅂 🅄🅂🄴 🅃🄷🄸🅂 🄻🄸🄽🄺 (☞ ͡° ͜ʖ ͡°)☞ :  https://pastebin.com/raw/UGK5026p
                                       //🇷 🇪 🇦 🇩 🇲 🇪 
 //[⚠️This is gonna make ur life a lil Easy just go on the link get all the codes u need and come back this is to help u with 𝕗𝕝𝕖𝕩 3 Im going to be updating the codes￼￼ alot⚠️]
//--------------------------------------------------------------------------------------------------
//ⓈⓉⒶⓇⓉ ⒽⒺⓇⒺ Aaron 🅤🅝🅓🅔🅡 🅣🅗🅘🅢 🅛🅘🅝🅔
//—————————————————————————————————

%hook SKPaymentTransaction
- (long long)transactionState {
    return 1;
} 
%end








//--------------------------------------------------------------------------------------------------
//              🄳🄾🄽🅃 🅃🄾🅄🄲🄷 🅃🄷🄸🅂 🄿🄰🅁🅃 [Aaron]
// -------------------------------------------------------------------------------------------------￼

//__________________________________________________________